{
  "runAt": "2025-09-04T01:31:15.695Z",
  "count": 5,
  "items": [
    {
      "id": 73,
      "slug": "trump-s-oldest-sons-american-bitcoin-stake-worth-1-5-billion",
      "coverImage": "https://lh3.googleusercontent.com/J6_coFbogxhRI9iM864NL_liGXvsQp2AupsKei7z0cNNfDvGUmWUy20nuUhkREQyrpY4bEeIBuc=s0-w300",
      "thumbnail": null,
      "excerpt": "Donald Trump's eldest sons have made headlines with a substantial financial achievement stemming from their investment in Bitcoin. Following the recent public offering of Bitcoin, their holdings are now valued at approximately $1.5 billion."
    },
    {
      "id": 74,
      "slug": "trump-s-crypto-gambit-a-5-billion-power-play-in-digital-gove",
      "coverImage": "https://lh3.googleusercontent.com/J6_coFbogxhRI9iM864NL_liGXvsQp2AupsKei7z0cNNfDvGUmWUy20nuUhkREQyrpY4bEeIBuc=s0-w300",
      "thumbnail": null,
      "excerpt": "In a surprising shift towards the digital realm, former President Donald Trump has launched an initiative that could reshape the governance of cryptocurrencies and blockchain technologies. This ambitious undertaking, estimated to require a staggering $5 billion, signals a commitment to establishing a robust framework for digital assets."
    },
    {
      "id": 75,
      "slug": "solana-outperforms-bitcoin-possibly-poised-to-follow-ether-s",
      "coverImage": "https://cdn.sanity.io/images/s3y3vcno/production/33a703fc2eb54b3d38ef5e3d5c9730552e449ac9-700x430.png",
      "thumbnail": null,
      "excerpt": "<strong>Excerpt:</strong> Solana has recently outperformed Bitcoin, with analysts suggesting it may be on the brink of mirroring Ether's impressive 200% rally. This potential shift highlights the growing interest in alternative cryptocurrencies."
    },
    {
      "id": 76,
      "slug": "ukraine-parliament-approves-first-reading-of-crypto-legaliza",
      "coverImage": "https://lh3.googleusercontent.com/J6_coFbogxhRI9iM864NL_liGXvsQp2AupsKei7z0cNNfDvGUmWUy20nuUhkREQyrpY4bEeIBuc=s0-w300",
      "thumbnail": null,
      "excerpt": "In a pivotal move for the digital finance sector, the Ukrainian Parliament has recently approved the first reading of a bill aimed at legalizing cryptocurrencies. This measure seeks to create a regulatory framework that will support the burgeoning crypto market in Ukraine."
    },
    {
      "id": 77,
      "slug": "trump-backed-crypto-firms-a-new-era-for-bitcoin-exposure-and",
      "coverImage": "https://lh3.googleusercontent.com/J6_coFbogxhRI9iM864NL_liGXvsQp2AupsKei7z0cNNfDvGUmWUy20nuUhkREQyrpY4bEeIBuc=s0-w300",
      "thumbnail": null,
      "excerpt": "In recent developments, cryptocurrency companies backed by former President Donald Trump are poised to reshape the landscape of Bitcoin investment. This new dynamic is not only expected to increase Bitcoin's exposure among investors but also to entwine the cryptocurrency with political movements that resonate with Trump supporters."
    }
  ]
}