{
  "runAt": "2025-09-10T04:16:22.996Z",
  "count": 4,
  "items": [
    {
      "id": 146,
      "slug": "crypto-exchange-gemini-raises-us-ipo-target-to-433-3-million-dgvbbz",
      "coverImage": "https://lh3.googleusercontent.com/J6_coFbogxhRI9iM864NL_liGXvsQp2AupsKei7z0cNNfDvGUmWUy20nuUhkREQyrpY4bEeIBuc=s0-w300",
      "thumbnail": null,
      "excerpt": "Gemini, a well-known platform in the cryptocurrency trading space, is making waves once more as it announces an increase to its planned IPO target, raising it to an impressive $433.3 million. This development highlights the growing confidence in the cryptocurrency market and the potential for exchanges to go public amidst increasing interest from investors."
    },
    {
      "id": 147,
      "slug": "gamestop-posts-narrower-loss-in-q2-as-bitcoin-holdings-lift-",
      "coverImage": "https://cdn.decrypt.co/resize/1024/height/512/wp-content/uploads/2025/05/gamestop-logo-decrypt-style-03-gID_7.png",
      "thumbnail": null,
      "excerpt": "GameStop Corp. has announced its financial results for the second quarter, revealing a narrower loss than in previous quarters. The company's move to integrate cryptocurrency, particularly Bitcoin, into its balance sheet appears to be paying off as it navigates through an evolving retail landscape."
    },
    {
      "id": 148,
      "slug": "crypto-payroll-solutions-transforming-fintech-startups-in-as",
      "coverImage": "https://lh3.googleusercontent.com/J6_coFbogxhRI9iM864NL_liGXvsQp2AupsKei7z0cNNfDvGUmWUy20nuUhkREQyrpY4bEeIBuc=s0-w300",
      "thumbnail": null,
      "excerpt": "As the fintech landscape continues to evolve across Asia, innovative payroll solutions utilizing cryptocurrency are emerging as a transformative force for startups in the region. OneSafe, a notable player in this field, exemplifies how these digital solutions are revolutionizing traditional payroll processes."
    },
    {
      "id": 149,
      "slug": "employment-data-revision-washes-60b-from-crypto-market-cap-c",
      "coverImage": "https://lh3.googleusercontent.com/J6_coFbogxhRI9iM864NL_liGXvsQp2AupsKei7z0cNNfDvGUmWUy20nuUhkREQyrpY4bEeIBuc=s0-w300",
      "thumbnail": null,
      "excerpt": "Recent revisions to employment statistics have sent shockwaves through the cryptocurrency market, resulting in an unexpected decline that has shed approximately $60 billion from its overall capitalization. Investors are grappling with the implications of this significant financial shift as the market responds to new economic indicators."
    }
  ]
}