[
  {
    "id": "https://www.newsbtc.com/news/chainlink/chainlink-and-polymarket-forge-new-alliance-link-forecasted-to-outperform-xrp-by-2030/",
    "title": "Chainlink And Polymarket Forge New Alliance: LINK Forecasted To Outperform XRP By 2030",
    "source": "newsbtc",
    "url": "https://www.newsbtc.com/news/chainlink/chainlink-and-polymarket-forge-new-alliance-link-forecasted-to-outperform-xrp-by-2030/",
    "orig_url": null,
    "summary": "Chainlink (LINK), one of the crypto market’s leading providers of decentralized oracle solutions, has announced a partnership with the prediction market platform Polymarket.  Polymarket Integrates Chainlink On Polygon  According to Friday’s announcement, the new integration is now live on the Polygon (POL) mainnet, enabling Polymarket to establish secure and real-time prediction markets centered around asset pricing, including numerous active cryptocurrency trading pairs.  This collaboration also explores new methodologies to address more subjective questions. By doing so, Polymarket seeks to reduce its dependence on social voting mechanisms, thereby mitigating resolution risks in its markets. Related Reading: Bitcoin Crawls Up On Weak Supply: 30D Momentum Reveals It Lacks Real Demand The integration combines Chainlink Data Streams, which deliver low-latency, timestamped, and verifiable oracle reports, with Chainlink Automation, ensuring timely and automated on-chain market settlements.  This infrastructure reportedly allows for swift resolution of any asset pricing predictions, such as Bitcoin (BTC) price forecasts, based on predetermined parameters. Sergey Nazarov, Co-Founder of Chainlink, commented on the partnership, stating that Polymarket’s decision to integrate Chainlink’s oracle infrastructure is a &#8220;pivotal milestone&#8221; that transforms the creation and settlement of prediction markets.  He emphasized that when outcomes are determined by high-quality data and tamper-proof computation, prediction markets evolve into reliable signals that can be trusted globally. This partnership is viewed as a significant advancement toward a future grounded in cryptographic truth. $100 Billion In DeFi Value Chainlink has established itself as a leading data infrastructure provider, securing nearly $100 billion in total value across various decentralized finance (DeFi) applications and facilitating transactions worth tens of trillions.  The protocol’s reliability stems from its decentralized network of independent node operators, which ensures that applications function seamlessly without single points of failure. Polymarket, on the other hand, launched in 2020, has rapidly grown into a source for real-time information. Its recent acquisition of QCEX, a CFTC-licensed exchange and clearinghouse for $112 million, highlights its goal to re-entering the US market.  Additionally, Polymarket has partnered with X (formerly Twitter) to offer integrated products that provide users with data-driven insights and personalized market recommendations. Related Reading: XRP Price Gets Tighter: Here’s The Level Keeping It From Price Discovery Looking ahead, market analysts are predicting that Chainlink’s growing adoption could lead to significant milestones in the coming years. One expert speculated that by 2030, Chainlink could surpass XRP in market significance.  In a social media post, crypto expert Fishy Catfish outlined various predictions, suggesting that Chainlink will become the dominant platform for building financial workflows on-chain and that the future will be characterized by asset-centric and application-centric ecosystems rather than chain-centric ones. When writing, Chainlink’s native token, LINK, surged by 5%, reaching $24.70. This price increase has caused the cryptocurrency to outperform its peers, such as Bitcoin, which has seen gains of 87% compared to LINK’s 133% year-to-date uptrend. Featured image from DALL-E, chart from TradingView.com",
    "publishedAt": "2025-09-13T06:00:55.000Z"
  },
  {
    "id": "https://ambcrypto.com/is-bitcoins-rally-at-risk-as-mvrv-falls-below-critical-level/",
    "title": "Is Bitcoin’s rally at risk as MVRV falls below critical level?",
    "source": "ambcrypto",
    "url": "https://ambcrypto.com/is-bitcoins-rally-at-risk-as-mvrv-falls-below-critical-level/",
    "orig_url": null,
    "summary": "<img width=\"1920\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/09/Evans-2025-09-12T154944.884-min.png\" class=\"attachment-full size-full wp-post-image\" alt=\"Bitcoin MVRV below SMA365: Is the bull cycle at risk?\" style=\"float:left; margin:0 15px 15px 0;\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://ambcrypto.com/wp-content/uploads/2025/09/Evans-2025-09-12T154944.884-min.png 1920w, https://ambcrypto.com/wp-content/uploads/2025/09/Evans-2025-09-12T154944.884-min-300x169.png 300w, https://ambcrypto.com/wp-content/uploads/2025/09/Evans-2025-09-12T154944.884-min-1024x576.png 1024w, https://ambcrypto.com/wp-content/uploads/2025/09/Evans-2025-09-12T154944.884-min-768x432.png 768w, https://ambcrypto.com/wp-content/uploads/2025/09/Evans-2025-09-12T154944.884-min-1536x864.png 1536w, https://ambcrypto.com/wp-content/uploads/2025/09/Evans-2025-09-12T154944.884-min-1200x675.png 1200w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Bitcoin faces fragile signals with weak MVRV and liquidity, but Futures data suggests breakout potential.",
    "publishedAt": "2025-09-13T06:00:44.000Z"
  },
  {
    "id": "https://cointelegraph.com/news/us-government-strategic-bitcoin-reserve-chances-high-alex-thorn?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "title": "‘Strong chance’ US will form Strategic Bitcoin Reserve this year: Alex Thorn",
    "source": "cointelegraph",
    "url": "https://cointelegraph.com/news/us-government-strategic-bitcoin-reserve-chances-high-alex-thorn?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "orig_url": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGUyZDQtNGM3Ni03NzgzLTljZTAtOWFmNTYxOGJkZGFi.jpg",
    "summary": "<p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGUyZDQtNGM3Ni03NzgzLTljZTAtOWFmNTYxOGJkZGFi.jpg\" alt=\"‘Strong chance’ US will form Strategic Bitcoin Reserve this year: Alex Thorn\"></p><p>Galaxy Digital’s Alex Thorn says the market is \"underpricing\" the odds of a US Strategic Bitcoin Reserve forming this year, though others are skeptical.</p>",
    "publishedAt": "2025-09-13T05:39:08.000Z"
  },
  {
    "id": "https://coinspectator.com/cointelegraph/2025/09/13/strong-chance-us-will-form-strategic-bitcoin-reserve-this-year-alex-thorn/",
    "title": "‘Strong chance’ US will form Strategic Bitcoin Reserve this year: Alex Thorn",
    "source": "coinspectator",
    "url": "https://coinspectator.com/cointelegraph/2025/09/13/strong-chance-us-will-form-strategic-bitcoin-reserve-this-year-alex-thorn/",
    "orig_url": null,
    "summary": "Galaxy Digital’s Alex Thorn says the market is &#8220;underpricing&#8221; the odds of a US Strategic Bitcoin Reserve forming this year, though others are skeptical. Read More",
    "publishedAt": "2025-09-13T05:39:08.000Z"
  },
  {
    "id": "https://coinspectator.com/bitcoin-com/2025/09/13/coinbase-urges-court-action-after-sec-watchdog-confirms-lost-gensler-texts/",
    "title": "Coinbase Urges Court Action After SEC Watchdog Confirms Lost Gensler Texts",
    "source": "coinspectator",
    "url": "https://coinspectator.com/bitcoin-com/2025/09/13/coinbase-urges-court-action-after-sec-watchdog-confirms-lost-gensler-texts/",
    "orig_url": null,
    "summary": "<img width=\"150\" height=\"150\" src=\"https://coinspectator.com/wp-content/uploads/2025/09/sec-coinbase-lost-gensler-messages-768x432-tGEPI8-150x150.jpg\" class=\"attachment-thumbnail size-thumbnail wp-post-image\" alt=\"Coinbase urges court action after sec watchdog confirms lost gensler texts\" decoding=\"async\" srcset=\"https://coinspectator.com/wp-content/uploads/2025/09/sec-coinbase-lost-gensler-messages-768x432-tGEPI8-150x150.jpg 150w, https://coinspectator.com/wp-content/uploads/2025/09/sec-coinbase-lost-gensler-messages-768x432-tGEPI8-88x88.jpg 88w\" sizes=\"(max-width: 150px) 100vw, 150px\" />Explosive new revelations expose the SEC’s widespread destruction of crypto-related communications, igniting a legal firestorm that Coinbase is using to challenge regulatory integrity in court. SEC Under Fire...",
    "publishedAt": "2025-09-13T05:30:10.000Z"
  },
  {
    "id": "https://www.newsbtc.com/bitcoin-news/bitcoin-bears-shaken-local-bottom-90-likely-set/",
    "title": "Bitcoin Bears Shaken—Analyst Says Local Bottom 90% Likely Set",
    "source": "newsbtc",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bears-shaken-local-bottom-90-likely-set/",
    "orig_url": null,
    "summary": "Bitcoin’s current rebound off the $107,200 low has sparked renewed debate over whether the market has already set its local bottom and is positioned to rally higher.. Independent analyst Astronomer (@astronomer_zero) argues that the probability is “90%+” that the low has been planted, citing both price structure and his recurring “FOMC reversal confluence” framework as confirmation. Analyst Claims 90% Chance The Bitcoin Bottom Is In Astronomer, who publicly documented his short-term bearish call from $123,000 down to the $110,000–$111,000 zone, revealed that he flipped long as the target was reached in late August. “Alright, as if the confluences of my confidence in the bottom being in the $110k area at the end of August weren&#8217;t strong enough … there now is another confluence lining up,” he wrote. According to him, the Federal Reserve’s policy meeting cycle has historically functioned as a turning point for Bitcoin trends. Related Reading: Countdown To Fed: Rate Decision Could Trigger Bitcoin Breakout He explained: “The FOMC meeting data reverses the ongoing trend at minimum 0 bars (on the date), or 6 bars at most before the date, and it has done that correctly 90%+ of the times. The few times it hasn&#8217;t, was because our quarterly long took over (which has more power).” In practice, Astronomer argues, markets front-run the event, as insiders and well-capitalized players set the post-FOMC direction before retail sentiment digests the outcome. With the next FOMC scheduled for September 18, he contends the downtrend from $123,000 to $110,000 already exhausted itself ahead of schedule. “Now with FOMC coming up … the low is likely already planted, and the trend reversed to up again,” he said. The analyst contrasted his methodology with the broader crypto commentary ecosystem, where many influencers continue to forecast further downside and a “red September.” He called such views “utter nonsense” rooted in surface-level seasonality. “Every time it does work, it plants its bottom before the actual meeting to front run the anticipation … insiders already have set the post FOMC price direction, regardless of the outcome,” he wrote, stressing that relying on generic “be careful” warnings ahead of central bank events misses the structural shift. Related Reading: This Bitcoin Cycle Changes Everything, Real Vision Analyst Explains Why After his long entry at $110,000, Bitcoin has since climbed above $115,000, prompting Astronomer to declare September’s bearish thesis already invalid. “ September will close green. Yup, Septembears officially 6% in the wrong now. As September opened at 108,299, and price is now at 115,000. That puts September in the upper historical quartile of how green it is at the moment,” he noted. He further pointed to the last two years as evidence that September’s reputation as a seasonally weak month for Bitcoin has lost statistical edge. “A certain month indeed doesn&#8217;t have to be green. ‘Seasonality’ is just a cookie cutter version of properly using cycles. Look at last two years, September has also been green and mean to the bears,” he wrote. For Astronomer, the conclusion is clear: “When many confluences point in the same direction, it usually means you have solved the rubik&#8217;s cube correctly and so can confidently believe.” Still, he tempered the conviction with risk management discipline, stating: “Of course, I could always be wrong, although it has been a long time we lost a trade, never go all in. Take a decent size risk and sleep sound.” With Bitcoin holding above $115,000 and the FOMC meeting days away, the market’s near-term verdict on whether a sustainable bottom has formed may arrive sooner rather than later. Featured image created with DALL.E, chart from TradingView.com",
    "publishedAt": "2025-09-13T05:00:31.000Z"
  },
  {
    "id": "https://coinspectator.com/newsbtc/2025/09/13/bitcoin-bears-shaken-analyst-says-local-bottom-90-likely-set/",
    "title": "Bitcoin Bears Shaken—Analyst Says Local Bottom 90% Likely Set",
    "source": "coinspectator",
    "url": "https://coinspectator.com/newsbtc/2025/09/13/bitcoin-bears-shaken-analyst-says-local-bottom-90-likely-set/",
    "orig_url": null,
    "summary": "<img width=\"150\" height=\"150\" src=\"https://coinspectator.com/wp-content/uploads/2025/09/ChatGPT-Image-Sep-12-2025-12_08_47-PM-u3GR7K-150x150.png\" class=\"attachment-thumbnail size-thumbnail wp-post-image\" alt=\"Bitcoin bears shaken—analyst says local bottom 90% likely set\" decoding=\"async\" loading=\"lazy\" srcset=\"https://coinspectator.com/wp-content/uploads/2025/09/ChatGPT-Image-Sep-12-2025-12_08_47-PM-u3GR7K-150x150.png 150w, https://coinspectator.com/wp-content/uploads/2025/09/ChatGPT-Image-Sep-12-2025-12_08_47-PM-u3GR7K-88x88.png 88w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" />Bitcoin’s current rebound off the $107,200 low has sparked renewed debate over whether the market has already set its local bottom and is positioned to rally higher.. Independent...",
    "publishedAt": "2025-09-13T05:00:31.000Z"
  },
  {
    "id": "https://www.newsbtc.com/news/dogecoin/dogecoin-eyes-historic-surge/",
    "title": "Dogecoin Breaks Out, Eyes Historic Surge Between $0.41–$0.97 – What To Expect",
    "source": "newsbtc",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-eyes-historic-surge/",
    "orig_url": null,
    "summary": "Dogecoin (DOGE) has staged a strong breakout after forming a double bottom near key support, surging past $0.26 and leaving earlier rejection zones behind. With the Bollinger Band width now hitting a historically bullish level, DOGE could be setting the stage for a major surge, targeting a price range between $0.41 and $0.97. Dogecoin Breaks Out After Double Bottom Formation In a recent post on X, BitGuru shared an analysis highlighting that DOGE has made a significant bullish move, breaking out from a classic double bottom chart pattern. This pattern formed near a key support level, signaling a potential reversal from a downtrend to an uptrend.  Related Reading: Dogecoin (DOGE) Eyes $0.30 as Channel Breakout Fuels Bullish Speculation By surging past the $0.26 mark, DOGE has confirmed this breakout and is now in a strong position for further gains. This decisive move, which is a critical development, puts previous resistance zones firmly in the rearview mirror.  The market now has a clear signal of continued bullish strength. Presently, momentum is being driven by buyers who have stepped in with enough force to push the price higher, indicating a shift in market sentiment. This sustained interest and upward pressure suggest that DOGE could be setting up for a more significant rally as it enters a new phase of its market cycle. Bollinger Band Width Hits Key Orange Level Based on his analysis of Dogecoin&#8217;s weekly chart, X crypto analyst Trader Tardigrade has revealed a compelling pattern related to the Bollinger Band Width (BBW). He notes that in the past, when the BBW for DOGE has reached a specific &#8220;orange level,&#8221; the cryptocurrency has gone on to see significant rallies, with price surges ranging from 100% to as much as 378%. Related Reading: Dogecoin To $0.50? This Channel Break Could Be The Catalyst The analyst&#8217;s post further highlights a critical development: the BBW has now returned to this very same &#8220;orange level.&#8221; Such recurrence suggests that a similar period of high volatility and explosive price movement could be imminent for Dogecoin. Based on this historical precedent, the analyst has set new price targets for DOGE. He is now eyeing a potential price range of $0.41 to $0.97 for the token, a forecast directly tied to the historical performance observed when the BBW reaches this key level. This analysis provides a strong bullish case for Dogecoin in the coming weeks and months. Dogecoin is currently experiencing bullish action, with its price trading around $0.2602, a notable increase of 3.78% over the past 24 hours. DOGE’s market capitalization stands at $39.29 billion, while its 24-hour trading volume has reached $4.09 billion, reflecting significant market activity and investor interest. Featured image from iStock, chart from Tradingview.com",
    "publishedAt": "2025-09-13T04:00:59.000Z"
  },
  {
    "id": "https://coinspectator.com/newsbtc/2025/09/13/dogecoin-breaks-out-eyes-historic-surge-between-0-41-0-97-what-to-expect/",
    "title": "Dogecoin Breaks Out, Eyes Historic Surge Between $0.41–$0.97 – What To Expect",
    "source": "coinspectator",
    "url": "https://coinspectator.com/newsbtc/2025/09/13/dogecoin-breaks-out-eyes-historic-surge-between-0-41-0-97-what-to-expect/",
    "orig_url": null,
    "summary": "<img width=\"150\" height=\"150\" src=\"https://coinspectator.com/wp-content/uploads/2025/09/Dogecoin-from-iStock-20-2wtGe2-150x150.jpg\" class=\"attachment-thumbnail size-thumbnail wp-post-image\" alt=\"Dogecoin breaks out, eyes historic surge between $0.41–$0.97 – what to expect\" decoding=\"async\" loading=\"lazy\" srcset=\"https://coinspectator.com/wp-content/uploads/2025/09/Dogecoin-from-iStock-20-2wtGe2-150x150.jpg 150w, https://coinspectator.com/wp-content/uploads/2025/09/Dogecoin-from-iStock-20-2wtGe2-88x88.jpg 88w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" />Dogecoin (DOGE) has staged a strong breakout after forming a double bottom near key support, surging past $0.26 and leaving earlier rejection zones behind. With the Bollinger Band...",
    "publishedAt": "2025-09-13T04:00:59.000Z"
  },
  {
    "id": "https://ambcrypto.com/heres-why-this-company-went-all-in-with-its-1-65b-solana-treasury-play/",
    "title": "Here’s why this company went ALL IN with its $1.65B Solana Treasury play",
    "source": "ambcrypto",
    "url": "https://ambcrypto.com/heres-why-this-company-went-all-in-with-its-1-65b-solana-treasury-play/",
    "orig_url": null,
    "summary": "<img width=\"1920\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/09/Samyukhtha-23.webp\" class=\"attachment-full size-full wp-post-image\" alt=\"Here&#039;s why this company went ALL IN with its $1.65B Solana Treasury play\" style=\"float:left; margin:0 15px 15px 0;\" decoding=\"async\" srcset=\"https://ambcrypto.com/wp-content/uploads/2025/09/Samyukhtha-23.webp 1920w, https://ambcrypto.com/wp-content/uploads/2025/09/Samyukhtha-23-300x169.webp 300w, https://ambcrypto.com/wp-content/uploads/2025/09/Samyukhtha-23-1024x576.webp 1024w, https://ambcrypto.com/wp-content/uploads/2025/09/Samyukhtha-23-768x432.webp 768w, https://ambcrypto.com/wp-content/uploads/2025/09/Samyukhtha-23-1536x864.webp 1536w, https://ambcrypto.com/wp-content/uploads/2025/09/Samyukhtha-23-1200x675.webp 1200w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Solana is pumping, and Forward’s massive PIPE deal just added to it!",
    "publishedAt": "2025-09-13T04:00:28.000Z"
  },
  {
    "id": "https://coinspectator.com/mainstream/2025/09/13/weekly-summary-prop-firms-sneak-into-india-through-education-cysecs-new-cfd-limits-downplayed-by-brokers/",
    "title": "Weekly Summary: Prop Firms Sneak Into India Through “Education”; CySEC’s New CFD Limits Downplayed by Brokers",
    "source": "coinspectator",
    "url": "https://coinspectator.com/mainstream/2025/09/13/weekly-summary-prop-firms-sneak-into-india-through-education-cysecs-new-cfd-limits-downplayed-by-brokers/",
    "orig_url": null,
    "summary": "<img width=\"150\" height=\"150\" src=\"https://coinspectator.com/wp-content/uploads/2025/09/Robinhood20launches20social20trading20platform20to20compete20with20Reddit20communities_id_9c312180-5583-47fb-815a-ec356b96d323_size900-0X1rbD-150x150.jpg\" class=\"attachment-thumbnail size-thumbnail wp-post-image\" alt=\"Weekly summary: prop firms sneak into india through “education”; cysec’s new cfd limits downplayed by brokers\" decoding=\"async\" loading=\"lazy\" srcset=\"https://coinspectator.com/wp-content/uploads/2025/09/Robinhood20launches20social20trading20platform20to20compete20with20Reddit20communities_id_9c312180-5583-47fb-815a-ec356b96d323_size900-0X1rbD-150x150.jpg 150w, https://coinspectator.com/wp-content/uploads/2025/09/Robinhood20launches20social20trading20platform20to20compete20with20Reddit20communities_id_9c312180-5583-47fb-815a-ec356b96d323_size900-0X1rbD-88x88.jpg 88w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" />Prop firms dodge restrictions in India with “education” branding Prop firms seem to have found a way into India’s market: Using “education” campaigns to attract clients while avoiding...",
    "publishedAt": "2025-09-13T04:00:00.000Z"
  },
  {
    "id": "https://cointelegraph.com/news/bitcoin-price-relevance-stock-gold-markets-arthur-hayes?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "title": "Bitcoiners chasing a quick Lambo are heading for a wipeout: Arthur Hayes",
    "source": "cointelegraph",
    "url": "https://cointelegraph.com/news/bitcoin-price-relevance-stock-gold-markets-arthur-hayes?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "orig_url": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDdmOTEtNjhlNi03NzdlLWFjZWUtNmU4YmE0N2I3NDhk.jpg",
    "summary": "<p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDdmOTEtNjhlNi03NzdlLWFjZWUtNmU4YmE0N2I3NDhk.jpg\" alt=\"Bitcoiners chasing a quick Lambo are heading for a wipeout: Arthur Hayes\"></p><p>Arthur Hayes says that Bitcoiners buying Bitcoin one day and expecting a Lamborghini the next is “not the right way to think about things.”</p>",
    "publishedAt": "2025-09-13T03:44:17.000Z"
  },
  {
    "id": "https://coinspectator.com/cointelegraph/2025/09/13/bitcoiners-chasing-a-quick-lambo-are-heading-for-a-wipeout-arthur-hayes/",
    "title": "Bitcoiners chasing a quick Lambo are heading for a wipeout: Arthur Hayes",
    "source": "coinspectator",
    "url": "https://coinspectator.com/cointelegraph/2025/09/13/bitcoiners-chasing-a-quick-lambo-are-heading-for-a-wipeout-arthur-hayes/",
    "orig_url": null,
    "summary": "Arthur Hayes says that Bitcoiners buying Bitcoin one day and expecting a Lamborghini the next is “not the right way to think about things.” Read More",
    "publishedAt": "2025-09-13T03:44:17.000Z"
  },
  {
    "id": "https://coinspectator.com/mainstream/2025/09/13/charlie-kirks-widow-pays-tribute-to-perfect-husband-and-says-her-cries-will-echo-around-the-world/",
    "title": "Charlie Kirk’s widow pays tribute to ‘perfect’ husband and says her cries ‘will echo around the world’",
    "source": "coinspectator",
    "url": "https://coinspectator.com/mainstream/2025/09/13/charlie-kirks-widow-pays-tribute-to-perfect-husband-and-says-her-cries-will-echo-around-the-world/",
    "orig_url": null,
    "summary": "<img width=\"150\" height=\"150\" src=\"https://coinspectator.com/wp-content/uploads/2025/09/skynews-charlie-kirk-erika-kirk_7018579-cm28V4-150x150.jpg\" class=\"attachment-thumbnail size-thumbnail wp-post-image\" alt=\"Charlie kirk&#039;s widow pays tribute to &#039;perfect&#039; husband and says her cries &#039;will echo around the world&#039;\" decoding=\"async\" loading=\"lazy\" srcset=\"https://coinspectator.com/wp-content/uploads/2025/09/skynews-charlie-kirk-erika-kirk_7018579-cm28V4-150x150.jpg 150w, https://coinspectator.com/wp-content/uploads/2025/09/skynews-charlie-kirk-erika-kirk_7018579-cm28V4-88x88.jpg 88w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" />Erika Kirk, the widow of conservative activist Charlie Kirk, described him as a &#8220;perfect&#8221; husband and father, and said the &#8220;evildoers&#8221; who assassinated him have no idea what...",
    "publishedAt": "2025-09-13T03:44:00.000Z"
  },
  {
    "id": "https://coinspectator.com/bitcoin-com/2025/09/13/cryptoquant-maps-ethereums-next-test-5-2k-realized-price-band/",
    "title": "Cryptoquant Maps Ethereum’s Next Test: $5.2K Realized-Price Band",
    "source": "coinspectator",
    "url": "https://coinspectator.com/bitcoin-com/2025/09/13/cryptoquant-maps-ethereums-next-test-5-2k-realized-price-band/",
    "orig_url": null,
    "summary": "<img width=\"150\" height=\"150\" src=\"https://coinspectator.com/wp-content/uploads/2025/09/ethersupplies-768x432-PaZ7UH-150x150.png\" class=\"attachment-thumbnail size-thumbnail wp-post-image\" alt=\"Cryptoquant maps ethereum’s next test: $5.2k realized price band\" decoding=\"async\" loading=\"lazy\" srcset=\"https://coinspectator.com/wp-content/uploads/2025/09/ethersupplies-768x432-PaZ7UH-150x150.png 150w, https://coinspectator.com/wp-content/uploads/2025/09/ethersupplies-768x432-PaZ7UH-88x88.png 88w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" />Analysts at cryptoquant.com say ethereum is riding “dual momentum,” pairing heavier institutional positioning with record onchain usage. Cryptoquant Report Notes Lower Selling Pressure While Ethereum’s Onchain Use Peaks...",
    "publishedAt": "2025-09-13T03:30:41.000Z"
  },
  {
    "id": "https://www.newsbtc.com/altcoin/dogecoin-defies-odds-jumps-21-even-as-etf-debut-gets-pushed-back/",
    "title": "Dogecoin Defies Odds, Jumps 21% Even As ETF Debut Gets Pushed Back",
    "source": "newsbtc",
    "url": "https://www.newsbtc.com/altcoin/dogecoin-defies-odds-jumps-21-even-as-etf-debut-gets-pushed-back/",
    "orig_url": null,
    "summary": "Dogecoin climbed after reports said the first US Dogecoin ETF won approval, even though its trading debut was pushed back. Traders piled in anyway, sending volume higher and sparking talk across exchanges and social channels. The memecoin’s bounce came amid mixed signals about timing. Related Reading: Institutional Adoption Rises: 21X Brings Chainlink Into Europe’s Tokenized Securities Market ETF Approval And Pushback Based on reports, the REX-Osprey Dogecoin ETF, ticker DOJE, received regulatory approval under the Investment Company Act of 1940. The fund had been expected to begin trading around September 18, 2025, but issuers later announced a delay to a new date. According to filings and press briefings, sponsors said they would set a revised listing date after finishing required steps. That move changed the calendar for investors who had been planning trades around the earlier target. Price Snapshot And Market Size According to figures from Coingecko, Dogecoin traded at $0.26 per coin after the news broke. Reported 24-hour volume topped $4 billion, and market capitalization sat around $39–40 billion. DOGE was up 5% and 21% in the 24-hour and seven-day timeframes. Update Part 3: Another delay. Launching next week. Mid week. Prob Thur. https://t.co/Lzk2pCVo0E — Eric Balchunas (@EricBalchunas) September 11, 2025 Technical watchers pointed to a pennant breakout pattern. Some analysts mentioned targets in the $0.28–$0.30 range if momentum holds. Traders closed some short positions and added long exposure during the session. Market Reaction And Flows Reports have disclosed that some large holders increased accumulation while retail traders chased momentum on social platforms. Options desks showed a rise in activity, and order books tightened on several major exchanges. At the same time, flows into crypto funds were being watched closely by market makers, who said early demand could determine whether the price move sticks. Volume spikes were sharp but brief in parts of the trading day. Community Response And Criticism Supporters welcomed easier, regulated access to DOGE through an ETF vehicle. Critics pushed back, warning that packaging a memecoin into a mainstream fund risks channeling more speculative cash into a product with no traditional utility. Based on market chatter, commentators raised questions about disclosure, trading rules, and whether retail investors fully understood the product’s risks. Public reaction split between excitement and caution. Related Reading: ETF Dreams For Dogecoin: Serious Possibility Or Just Hype? What To Watch Next Investors will be watching the sponsors’ new listing date, the fund’s first filings, and early inflows when the debut finally occurs. Order books, options open interest, and short interest are key early signals. If the fund draws strong inflows, Dogecoin could stay bid and push toward the $0.28–$0.30 targets some traders cite. If interest fades, gains could be tested quickly. This remains a developing story. Market participants should check live prices, official filings, and sponsor statements before trading. Featured image from Pixabay, chart from TradingView",
    "publishedAt": "2025-09-13T03:00:59.000Z"
  },
  {
    "id": "https://coinspectator.com/newsbtc/2025/09/13/dogecoin-defies-odds-jumps-21-even-as-etf-debut-gets-pushed-back/",
    "title": "Dogecoin Defies Odds, Jumps 21% Even As ETF Debut Gets Pushed Back",
    "source": "coinspectator",
    "url": "https://coinspectator.com/newsbtc/2025/09/13/dogecoin-defies-odds-jumps-21-even-as-etf-debut-gets-pushed-back/",
    "orig_url": null,
    "summary": "<img width=\"150\" height=\"150\" src=\"https://coinspectator.com/wp-content/uploads/2025/09/a_f1b399-Og6AR9-150x150.jpg\" class=\"attachment-thumbnail size-thumbnail wp-post-image\" alt=\"Dogecoin defies odds, jumps 21% even as etf debut gets pushed back\" decoding=\"async\" loading=\"lazy\" srcset=\"https://coinspectator.com/wp-content/uploads/2025/09/a_f1b399-Og6AR9-150x150.jpg 150w, https://coinspectator.com/wp-content/uploads/2025/09/a_f1b399-Og6AR9-88x88.jpg 88w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" />Dogecoin climbed after reports said the first US Dogecoin ETF won approval, even though its trading debut was pushed back. Traders piled in anyway, sending volume higher and...",
    "publishedAt": "2025-09-13T03:00:59.000Z"
  },
  {
    "id": "https://ambcrypto.com/bitcoin-will-btcs-next-rally-hit-140k-as-miner-behavior-shifts/",
    "title": "Bitcoin – Will BTC’s next rally hit $140K as miner behavior shifts?",
    "source": "ambcrypto",
    "url": "https://ambcrypto.com/bitcoin-will-btcs-next-rally-hit-140k-as-miner-behavior-shifts/",
    "orig_url": null,
    "summary": "<img width=\"1920\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/09/Erastus-2025-09-12T150857.423-min.png\" class=\"attachment-full size-full wp-post-image\" alt=\"Scarcity and miner behavior: Will Bitcoin’s next rally reach $140K?\" style=\"float:left; margin:0 15px 15px 0;\" decoding=\"async\" srcset=\"https://ambcrypto.com/wp-content/uploads/2025/09/Erastus-2025-09-12T150857.423-min.png 1920w, https://ambcrypto.com/wp-content/uploads/2025/09/Erastus-2025-09-12T150857.423-min-300x169.png 300w, https://ambcrypto.com/wp-content/uploads/2025/09/Erastus-2025-09-12T150857.423-min-1024x576.png 1024w, https://ambcrypto.com/wp-content/uploads/2025/09/Erastus-2025-09-12T150857.423-min-768x432.png 768w, https://ambcrypto.com/wp-content/uploads/2025/09/Erastus-2025-09-12T150857.423-min-1536x864.png 1536w, https://ambcrypto.com/wp-content/uploads/2025/09/Erastus-2025-09-12T150857.423-min-1200x675.png 1200w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Reduced miner flows and rising scarcity could fuel Bitcoin’s push toward $140K.",
    "publishedAt": "2025-09-13T03:00:11.000Z"
  },
  {
    "id": "https://www.newsbtc.com/news/ondo-finance-surges-20-weekly-amid-hype-and-growing-defi-demand/",
    "title": "Ondo Finance Surges 20% Weekly Amid Hype and Growing DeFi Demand",
    "source": "newsbtc",
    "url": "https://www.newsbtc.com/news/ondo-finance-surges-20-weekly-amid-hype-and-growing-defi-demand/",
    "orig_url": null,
    "summary": "Ondo Finance (ONDO) has risen as one of the top performers in the market this week, surging 20% to trade around $1.10. The rally comes as demand for real-world asset (RWA) tokenization accelerates, pushing Ondo’s TVL to record highs. Related Reading: Cardano Is Not Dead: Analyst Confirms Breakout With New ADA Price Targets The recently launched Ondo Global Markets platform has been a major growth driver, attracting over $160 million in assets within days. The service enables investors to access tokenized versions of more than 100 stocks and ETFs, including Tesla, Nvidia, and Google. By bringing Wall Street assets onto the blockchain, Ondo is positioning itself as a leader in the $26 billion RWA tokenization market. Analysts argue that this move could transform global investing, particularly for users outside the U.S., who have traditionally faced barriers to stock market participation. Ondo Finance&#8217;s Total Value Locked Hits $1.57 Billion Beyond its equities platform, Ondo Finance has seen explosive growth across its ecosystem. TVL on its DeFi protocols has surged from $563 million earlier this year to more than $1.57 billion today. This spike is primarily fueled by Ondo’s yield-bearing products, such as: Ondo US Dollar Yield (USDY): Over $500 million in assets Ondo Short-Term U.S. Treasuries Fund (OUSG): $724 million locked The firm’s lending arm, Flux, has also expanded rapidly, now managing $42 million in assets compared to just $4 million last November. Like Aave’s Horizon, Flux lets users borrow stablecoins against tokenized U.S. Treasuries, creating new liquidity avenues. Ondo has also launched its own blockchain, tailored for tokenization, which strengthens its moat in a sector projected to reach trillions of dollars in value. ONDO's price trends to the upside on the daily chart. Source: ONDOUSD on Tradingview ONDO Price Outlook: Can Bulls Break $1.145? Technically, Ondo has formed an inverse head-and-shoulders pattern, a bullish reversal signal. The token recently broke past the $1.05 resistance and is now eyeing a breakout above $1.145, last seen in July. A successful move could open the door toward $1.18 and even $1.26 in the short term. However, traders are watching closely for profit-taking risks, as ONDO’s relative strength index (RSI) signals overbought conditions. Regardless, with BlackRock signaling blockchain-based ETFs and Fed rate cuts expected to fuel a broader risk rally, momentum could remain in Ondo’s favor. Related Reading: XRP Exchange Reserves Balloon 1.2 Billion In One Day, Why This Is Bearish For Price If sustained, Ondo Finance’s surge not only grows its role as a DeFi leader but also builds the fast-growing demand for tokenized real-world assets. Cover image from ChatGPT, ONDOUSD chart from Tradingview",
    "publishedAt": "2025-09-13T02:00:17.000Z"
  },
  {
    "id": "https://coinspectator.com/newsbtc/2025/09/13/ondo-finance-surges-20-weekly-amid-hype-and-growing-defi-demand/",
    "title": "Ondo Finance Surges 20% Weekly Amid Hype and Growing DeFi Demand",
    "source": "coinspectator",
    "url": "https://coinspectator.com/newsbtc/2025/09/13/ondo-finance-surges-20-weekly-amid-hype-and-growing-defi-demand/",
    "orig_url": null,
    "summary": "<img width=\"150\" height=\"150\" src=\"https://coinspectator.com/wp-content/uploads/2025/09/iStock-1314199360-MuhfMa-150x150.jpg\" class=\"attachment-thumbnail size-thumbnail wp-post-image\" alt=\"Ondo finance surges 20% weekly amid hype and growing defi demand\" decoding=\"async\" loading=\"lazy\" srcset=\"https://coinspectator.com/wp-content/uploads/2025/09/iStock-1314199360-MuhfMa-150x150.jpg 150w, https://coinspectator.com/wp-content/uploads/2025/09/iStock-1314199360-MuhfMa-88x88.jpg 88w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" />Ondo Finance (ONDO) has risen as one of the top performers in the market this week, surging 20% to trade around $1.10. The rally comes as demand for...",
    "publishedAt": "2025-09-13T02:00:17.000Z"
  },
  {
    "id": "https://cointelegraph.com/news/prediction-market-kalshi-massachusetts-lawsuit?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "title": "Kalshi ‘ready to defend’ prediction markets amid Massachusetts lawsuit",
    "source": "cointelegraph",
    "url": "https://cointelegraph.com/news/prediction-market-kalshi-massachusetts-lawsuit?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "orig_url": "https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmVlZGEtYzM3YS03MTA4LWIwZWQtNGQ2NGFjNjRiNzcy.jpg",
    "summary": "<p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmVlZGEtYzM3YS03MTA4LWIwZWQtNGQ2NGFjNjRiNzcy.jpg\" alt=\"Kalshi ‘ready to defend’ prediction markets amid Massachusetts lawsuit\"></p><p>In comments to Cointelegraph, Kalshi claimed that Massachusetts is “trying to block Kashi’s innovations by relying on outdated laws.\"</p>",
    "publishedAt": "2025-09-13T01:07:35.000Z"
  },
  {
    "id": "https://ambcrypto.com/bitcoins-price-surge-past-115k-spurs-crypto-stocks-by-double-digits-explained/",
    "title": "Bitcoin’s price surge past $115K spurs crypto stocks by double-digits",
    "source": "ambcrypto",
    "url": "https://ambcrypto.com/bitcoins-price-surge-past-115k-spurs-crypto-stocks-by-double-digits-explained/",
    "orig_url": null,
    "summary": "<img width=\"1920\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/09/Crypto-stocks-Featured.webp\" class=\"attachment-full size-full wp-post-image\" alt=\"Crypto stocks post double-digit percentage gains as Bitcoin climbs past $115k\" style=\"float:left; margin:0 15px 15px 0;\" decoding=\"async\" srcset=\"https://ambcrypto.com/wp-content/uploads/2025/09/Crypto-stocks-Featured.webp 1920w, https://ambcrypto.com/wp-content/uploads/2025/09/Crypto-stocks-Featured-300x169.webp 300w, https://ambcrypto.com/wp-content/uploads/2025/09/Crypto-stocks-Featured-1024x576.webp 1024w, https://ambcrypto.com/wp-content/uploads/2025/09/Crypto-stocks-Featured-768x432.webp 768w, https://ambcrypto.com/wp-content/uploads/2025/09/Crypto-stocks-Featured-1536x864.webp 1536w, https://ambcrypto.com/wp-content/uploads/2025/09/Crypto-stocks-Featured-1200x675.webp 1200w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Crypto Fear and Greed Index had a reading of 57 at press time, highlighting greed in the market.",
    "publishedAt": "2025-09-13T01:00:10.000Z"
  },
  {
    "id": "https://www.newsbtc.com/news/ethereum/ethereum-validator-slashing/",
    "title": "Ethereum Validator Slashing Puts Cardano’s Resilience In Focus – Here’s Why",
    "source": "newsbtc",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-validator-slashing/",
    "orig_url": null,
    "summary": "A recent slashing of Ethereum from different validators has reignited the debate around staking models, with many pointing to Cardano’s more resilient structure as a key differentiator. While Ethereum’s system penalizes validators for downtime or misbehavior, Cardano’s staking approach avoids such risks, offering delegators security without the fear of losing funds.  Why Simplicity And Resilience Are Cardano’s Key Advantages On September 10, a slashing of 11.7 ETH from 39 Ethereum validators highlights the advantages of Cardano’s staking structure. Crypto analyst Dori has highlighted on X the fundamental differences in staking requirements and risks between the two networks. On Ethereum, it is structurally impossible to stake 0.1 ETH directly on ETH, but an individual must stake a minimum of 32 ETH and operate a validator node themselves.  Related Reading: Ethereum Investors Double Down As Staking Activity Spikes Sharply – Here’s How Much However, platforms have been built on Ethereum to allow staking with as little as 0.1 ETH, and liquid tokens are issued. The critical difference is that, due to the slashing mechanism, Ethereum&#8217;s structure carries the risk of a cascading collapse. This has given rise to platforms like Ankr and Lido Finance, which pool ETH from many users, run validators, and issue liquid staking tokens such as ankrETH and stETH to solve the problem of locked-up funds. In this incident, an operational mistake by the operators of 39 validators led to a slashing penalty of 11.7 ETH, which is worth approximately $52,000. If a larger slashing event were to occur, it could lead to the de-pegging of the liquid staking tokens, potentially triggering a cascading collapse as DeFi ecosystem protocols built upon them. On Ethereum, iquid staking platforms were developed to remove obstacles to staking, and liquid tokens were distributed to address the issue of lock-ups. In contrast, Cardana&#8217;s staking model allows anyone to stake as little as 10 ADA in a stake pool without worrying about slashing. There are no lock-up periods, and a user&#8217;s staked funds are never at risk of being lost, even if their chosen stake pool misbehaves. Fundamentally Different Approaches To Staking Cardanians (CRDN) also stated that a critical flaw in Ethereum&#8217;s staking model has been exposed, highlighting the fundamental advantages of Cardano&#8217;s design. The data shows that the Ethereum staking exit queue has hit an all-time high, forcing users who unstake their ETH to wait an estimated 46 days to get their funds back. Related Reading: Cardano Secures The Crown: Now The Most Decentralized Blockchain On Earth – Here’s How However, Cardano&#8217;s ADA staking model offers a fundamentally different experience, with liquid staking and no entry or exit queues. When a user stakes their ADA, the funds remain in their wallet and are always available for use or transfer, and earn rewards without being locked up. &#8220;The design is fundamentally better,&#8221; the expert noted. Featured image from Adobe Stock, chart from Tradingview.com",
    "publishedAt": "2025-09-13T01:00:00.000Z"
  }
]